Revit 2024 API
SpatialElementBoundarySubface Methods
The SpatialElementBoundarySubface type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBoundingElementFace
 Returns the face of the bounding element.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSpatialElementFace
 Returns the face of the spatial element's 3D geometry.
GetSubface
 Returns a face that represents the portion of the room face bounded by the boundary element.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace